CSI API ETABS v1
cAnalysisResults.StoryDrifts Method
 Reports the story drifts
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int StoryDrifts(
	ref int NumberResults,
	ref string[] Story,
	ref string[] LoadCase,
	ref string[] StepType,
	ref double[] StepNum,
	ref string[] Direction,
	ref double[] Drift,
	ref string[] Label,
	ref double[] X,
	ref double[] Y,
	ref double[] Z
)
Function StoryDrifts (
	ByRef NumberResults As Integer,
	ByRef Story As String(),
	ByRef LoadCase As String(),
	ByRef StepType As String(),
	ByRef StepNum As Double(),
	ByRef Direction As String(),
	ByRef Drift As Double(),
	ByRef Label As String(),
	ByRef X As Double(),
	ByRef Y As Double(),
	ByRef Z As Double()
) As Integer
Dim instance As cAnalysisResults
Dim NumberResults As Integer
Dim Story As String()
Dim LoadCase As String()
Dim StepType As String()
Dim StepNum As Double()
Dim Direction As String()
Dim Drift As Double()
Dim Label As String()
Dim X As Double()
Dim Y As Double()
Dim Z As Double()
Dim returnValue As Integer
returnValue = instance.StoryDrifts(NumberResults,
	Story, LoadCase, StepType, StepNum,
	Direction, Drift, Label, X, Y, Z)
int StoryDrifts(
	int% NumberResults,
	array<String^>^% Story,
	array<String^>^% LoadCase,
	array<String^>^% StepType,
	array<double>^% StepNum,
	array<String^>^% Direction,
	array<double>^% Drift,
	array<String^>^% Label,
	array<double>^% X,
	array<double>^% Y,
	array<double>^% Z
)
abstract StoryDrifts :
        NumberResults : int byref *
        Story : string[] byref *
        LoadCase : string[] byref *
        StepType : string[] byref *
        StepNum : float[] byref *
        Direction : string[] byref *
        Drift : float[] byref *
        Label : string[] byref *
        X : float[] byref *
        Y : float[] byref *
        Z : float[] byref -> int
Parameters
NumberResults
Type: System.Int32
 The total number of results returned by the program
Story
Type: System.String[]
 This is an array of the story levels for each result
LoadCase
Type: System.String[]
 This is an array of the names of the analysis case or load combination associated with each result
StepType
Type: System.String[]
 This is an array of the step types, if any, for each result
StepNum
Type: System.Double[]
 This is an array of the step numbers, if any, for each result
Direction
Type: System.String[]
 This is an array of the directions of the Drift values
Drift
Type: System.Double[]
 This is an array of the drift values
Label
Type: System.String[]
 This is an array of the point labels for each result
X
Type: System.Double[]
 This is an array of the displacements in the X direction [L]
Y
Type: System.Double[]
 This is an array of the displacements in the Y direction [L]
Z
Type: System.Double[]
 This is an array of the displacements in the Z direction [L]
Return Value
Type: Int32
 Returns zero if the results are successfully recovered, otherwise it returns a nonzero value
Remarks
 See Results for more information.
See Also
Reference
cAnalysisResults Interface
ETABSv1 Namespace